experiments/2026-08-18-qwen-qwen3-8b-v1-5fa1f7e/nano-vllm__prefix.log
INFO 08-18 17:55:04 [importing.py:53] Triton is installed but 0 active driver(s) found (expected 1). Disabling Triton to prevent runtime errors.
INFO 08-18 17:55:04 [importing.py:88] Triton not installed or not compatible; certain GPU-related functions will not be available.
INFO 08-18 17:55:06 [main.py:71] Unspecified platform detected, switching to CPU Platform instead.
WARNING 08-18 17:55:06 [cpu.py:440] Failed to import from vllm._C: ModuleNotFoundError("No module named 'vllm._C'")
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7074bb7a4fe0>, trust_remote_code=False, seed=0, num_prompts=100, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=128, random_output_len=256, random_range_ratio='0.0', random_prefix_len=2048, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai', base_url='http://nano-vllm:8001', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=None, model='Qwen/Qwen3-8B', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, probe_request_rate=0.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='/results', result_filename='nano-vllm__prefix.json', ignore_eos=False, self_timed=None, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='99', goodput=None, request_id_prefix='bench-052d35db-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 08-18 17:55:09 [utils.py:90] Sampling input_len from [128, 128] and output_len from [256, 256]
WARNING: /tokenize unavailable, skipping alignment.
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     100       
Failed requests:                         0         
Benchmark duration (s):                  403.22    
Total input tokens:                      217600    
Total generated tokens:                  23528     
Request throughput (req/s):              0.25      
Output token throughput (tok/s):         58.35     
Peak output token throughput (tok/s):    72.00     
Peak concurrent requests:                100.00    
Total token throughput (tok/s):          598.01    
---------------Time to First Token----------------
Mean TTFT (ms):                          183839.72 
Median TTFT (ms):                        177054.24 
P99 TTFT (ms):                           384068.40 
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          131.37    
Median TPOT (ms):                        133.40    
P99 TPOT (ms):                           153.76    
---------------Inter-token Latency----------------
Mean ITL (ms):                           133.43    
Median ITL (ms):                         123.46    
P99 ITL (ms):                            484.36    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          214524.85 
Median E2EL (ms):                        210942.22 
P99 E2EL (ms):                           403100.22 
==================================================

--- stderr ---
W0818 17:55:05.077000 1 torch/utils/cpp_extension.py:178] No CUDA runtime is found, using CUDA_HOME='/usr/local/cuda'
Warning: You are sending unauthenticated requests to the HF Hub. Please set a HF_TOKEN to enable higher rate limits and faster downloads.

  0%|          | 0/100 [00:00<?, ?it/s]
  1%|          | 1/100 [00:22<36:54, 22.37s/it]
  2%|▏         | 2/100 [00:22<15:30,  9.49s/it]
  3%|▎         | 3/100 [00:35<17:28, 10.81s/it]
  4%|▍         | 4/100 [00:35<10:46,  6.73s/it]
  9%|▉         | 9/100 [00:57<07:28,  4.93s/it]
 10%|█         | 10/100 [00:57<06:13,  4.15s/it]
 11%|█         | 11/100 [01:01<05:59,  4.04s/it]
 12%|█▏        | 12/100 [01:02<04:53,  3.33s/it]
 13%|█▎        | 13/100 [01:10<06:40,  4.60s/it]
 14%|█▍        | 14/100 [01:11<05:05,  3.55s/it]
 18%|█▊        | 18/100 [01:32<06:14,  4.56s/it]
 19%|█▉        | 19/100 [01:35<05:56,  4.40s/it]
 20%|██        | 20/100 [01:36<04:55,  3.69s/it]
 21%|██        | 21/100 [01:45<06:17,  4.78s/it]
 22%|██▏       | 22/100 [01:45<04:52,  3.75s/it]
 26%|██▌       | 26/100 [01:58<04:10,  3.38s/it]
 27%|██▋       | 27/100 [02:07<05:17,  4.35s/it]
 28%|██▊       | 28/100 [02:10<05:02,  4.20s/it]
 29%|██▉       | 29/100 [02:11<04:06,  3.47s/it]
 30%|███       | 30/100 [02:20<05:27,  4.68s/it]
 31%|███       | 31/100 [02:20<04:09,  3.61s/it]
 34%|███▍      | 34/100 [02:32<04:12,  3.82s/it]
 35%|███▌      | 35/100 [02:41<05:15,  4.86s/it]
 36%|███▌      | 36/100 [02:45<04:53,  4.58s/it]
 37%|███▋      | 37/100 [02:46<03:52,  3.69s/it]
 38%|███▊      | 38/100 [02:47<03:05,  2.99s/it]
 39%|███▉      | 39/100 [02:55<04:22,  4.30s/it]
 40%|████      | 40/100 [02:55<03:14,  3.24s/it]
 43%|████▎     | 43/100 [02:56<01:37,  1.71s/it]
 44%|████▍     | 44/100 [03:04<02:45,  2.95s/it]
 45%|████▌     | 45/100 [03:17<04:40,  5.10s/it]
 46%|████▌     | 46/100 [03:20<04:15,  4.74s/it]
 47%|████▋     | 47/100 [03:21<03:17,  3.73s/it]
 48%|████▊     | 48/100 [03:22<02:35,  2.99s/it]
 49%|████▉     | 49/100 [03:29<03:34,  4.21s/it]
 50%|█████     | 50/100 [03:30<02:43,  3.26s/it]
 51%|█████     | 51/100 [03:31<02:00,  2.46s/it]
 52%|█████▏    | 52/100 [03:31<01:30,  1.88s/it]
 53%|█████▎    | 53/100 [03:35<01:51,  2.37s/it]
 54%|█████▍    | 54/100 [03:39<02:20,  3.05s/it]
 55%|█████▌    | 55/100 [03:49<03:41,  4.92s/it]
 56%|█████▌    | 56/100 [03:55<04:00,  5.47s/it]
 57%|█████▋    | 57/100 [03:56<02:55,  4.09s/it]
 58%|█████▊    | 58/100 [03:57<02:12,  3.16s/it]
 59%|█████▉    | 59/100 [04:05<03:06,  4.56s/it]
 60%|██████    | 60/100 [04:06<02:15,  3.38s/it]
 61%|██████    | 61/100 [04:09<02:13,  3.42s/it]
 62%|██████▏   | 62/100 [04:14<02:24,  3.79s/it]
 63%|██████▎   | 63/100 [04:23<03:21,  5.43s/it]
 64%|██████▍   | 64/100 [04:30<03:29,  5.81s/it]
 65%|██████▌   | 65/100 [04:31<02:31,  4.33s/it]
 66%|██████▌   | 66/100 [04:32<01:53,  3.32s/it]
 67%|██████▋   | 67/100 [04:40<02:35,  4.72s/it]
 68%|██████▊   | 68/100 [04:40<01:51,  3.49s/it]
 69%|██████▉   | 69/100 [04:44<01:49,  3.54s/it]
 70%|███████   | 70/100 [04:45<01:20,  2.70s/it]
 71%|███████   | 71/100 [04:49<01:32,  3.18s/it]
 72%|███████▏  | 72/100 [04:58<02:19,  4.98s/it]
 73%|███████▎  | 73/100 [05:05<02:28,  5.50s/it]
 74%|███████▍  | 74/100 [05:06<01:46,  4.11s/it]
 75%|███████▌  | 75/100 [05:14<02:16,  5.45s/it]
 76%|███████▌  | 76/100 [05:15<01:36,  4.00s/it]
 77%|███████▋  | 77/100 [05:19<01:28,  3.86s/it]
 78%|███████▊  | 78/100 [05:19<01:04,  2.92s/it]
 79%|███████▉  | 79/100 [05:24<01:10,  3.33s/it]
 80%|████████  | 80/100 [05:33<01:42,  5.11s/it]
 81%|████████  | 81/100 [05:39<01:45,  5.57s/it]
 82%|████████▏ | 82/100 [05:40<01:14,  4.16s/it]
 83%|████████▎ | 83/100 [05:49<01:33,  5.49s/it]
 84%|████████▍ | 84/100 [05:50<01:04,  4.02s/it]
 85%|████████▌ | 85/100 [05:53<00:58,  3.90s/it]
 86%|████████▌ | 86/100 [05:54<00:41,  2.95s/it]
 87%|████████▋ | 87/100 [05:58<00:43,  3.35s/it]
 88%|████████▊ | 88/100 [06:07<01:01,  5.10s/it]
 89%|████████▉ | 89/100 [06:14<01:01,  5.57s/it]
 90%|█████████ | 90/100 [06:15<00:41,  4.16s/it]
 91%|█████████ | 91/100 [06:23<00:48,  5.37s/it]
 92%|█████████▏| 92/100 [06:24<00:31,  3.98s/it]
 93%|█████████▎| 93/100 [06:24<00:20,  2.97s/it]
 94%|█████████▍| 94/100 [06:27<00:17,  2.95s/it]
 95%|█████████▌| 95/100 [06:28<00:10,  2.15s/it]
 96%|█████████▌| 96/100 [06:30<00:09,  2.33s/it]
 97%|█████████▋| 97/100 [06:39<00:12,  4.32s/it]
 98%|█████████▊| 98/100 [06:40<00:06,  3.10s/it]
 99%|█████████▉| 99/100 [06:43<00:03,  3.08s/it]
100%|██████████| 100/100 [06:43<00:00,  2.19s/it]
100%|██████████| 100/100 [06:43<00:00,  4.03s/it]